#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-BrNKF37H8Rhq4emR

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=3c888834-46b1-435d-8cc1-5b1ac7992345]
data.digitalocean_kubernetes_cluster.openarabic: Reading...
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 1s [id=3c888834-46b1-435d-8cc1-5b1ac7992345]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]
helm_release.istio-base: Refreshing state... [id=istio-base]
helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
helm_release.metrics-server: Refreshing state... [id=metrics-server]
helm_release.flagger: Refreshing state... [id=flagger]
helm_release.prometheus-stack: Refreshing state... [id=prometheus-stack]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.flagger will be created
  + resource "helm_release" "flagger" {
      + atomic                     = false
      + chart                      = "flagger"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flagger"
      + namespace                  = "linkerd"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flagger.app"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.21.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "meshProvider"
          + value = "linkerd"
        }
      + set {
          + name  = "metricsServer"
          + value = "http://prometheus.istio-system:9090"
        }
    }

  # kubernetes_namespace.openarabic will be updated in-place
  ~ resource "kubernetes_namespace" "openarabic" {
        id = "openarabic"

      ~ metadata {
          ~ labels           = {
              - "istio-injection"   = "enabled" -> null
              + "linkerd.io/inject" = "enabled"
            }
            name             = "openarabic"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*